CARD_DATA_HEADER = [
    '编号',  # 0
    '名字',  # 1
    '主属性',  # 2
    '副属性',  # 3
    '究极进化',  # 4
    '类型1',  # 5
    '类型2',  # 6
    '稀有度',  # 7
    'COST',  # 8
    '未知009',  # 9
    '最大级别',  # 10
    '饲料价值',  # 11 需要除4
    '实装',  # 12  1=未实装 100=实装
    '金币价值',  # 13 需要除10
    '最小HP',  # 14
    '最大HP',  # 15
    'HP成长',  # 16
    '最小攻击',  # 17
    '最大攻击',  # 18
    '攻击成长',  # 19
    '最小回复',  # 20
    '最大回复',  # 21
    '回复成长',  # 22
    '最大经验',  # 23
    '经验比例',  # 24
    '主动技能ID',  # 25
    '队长技能ID',  # 26
    '敌人行动间隔',  # 27
    '敌人最小HP',  # 28
    '敌人最大HP',  # 29
    '敌人HP成长',  # 30
    '敌人最小攻击',  # 31
    '敌人最大攻击',  # 32
    '敌人攻击成长',  # 33
    '敌人最小防御',  # 34
    '敌人最大防御',  # 35
    '敌人防御成长',  # 36
    '敌人最大等级',  # 37
    '敌人每级金币奖励',  # 38 需除2
    '敌人每级经验奖励',  # 39 需除2
    '进化前ID',  # 40
    '进化材料1',  # 41
    '进化材料2',  # 42
    '进化材料3',  # 43
    '进化材料4',  # 44
    '进化材料5',  # 45
    '退化材料1',  # 46
    '退化材料2',  # 47
    '退化材料3',  # 48
    '退化材料4',  # 49
    '退化材料5',  # 50
    '技术地下城行动间隔',  # 51  >0时有效
    '使用新AI',  # 52 bool
    '敌人技能计数器',  # 53
    '敌人技能计数器增量',  # 54
    '未知055',  # 55
    '未知056',  # 56
    '敌人行动表',  # 57 List
    '觉醒',  # 58 List
    '超觉醒',  # 59 逗号分隔的数字列表
    '祖先ID',  # 60 同个宠物不同进化版本中，最顶级的ID
    '系统ID',  # 61 可能是图鉴里的按分组，不包括0
    '类型3',  # 62
    'MP价值',  # 63
    '激活潜在觉醒',  # 64
    '合作ID',  # 65
    'flags',  # 66 多个flags
    '搜索关键词',  # 67
    'limit_mult',  # 68
    '语音ID',  # 69
    '宝珠皮肤解锁',  # 70
    '额外信息',  # 71
]


SKILL_DATA_HEADER = [
    '名字',  # 0
    '描述',  # 1
    '技能类型',  # 2
    '等级',  # 3
    '最大冷却',  # 4
    '未知005',  # 5
    '参数1',  # 6
    '参数2',  # 7
    '参数3',  # 8
    '参数4',  # 9
    '参数5',  # 10
    '参数6',  # 11
    '参数7',  # 12
    '参数8',  # 13
]
